Revit 2024 API
PDFExportOptions Class
 Options for PDF export
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public class PDFExportOptions : IDisposable
Visual Basic
Public Class PDFExportOptions _
	Implements IDisposable
Visual C++
public ref class PDFExportOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PDFExportOptions
See Also
PDFExportOptions Members
Autodesk.Revit.DB Namespace